app/views/leagues/index.html.erb

SELECT COUNT(*) FROM "teams" WHERE "teams"."league_id" = ?  [["league_id", 2]]
---
        <td> <%= link_to "#{l.name}", l  %> </td>
        <td> <%= l.teams.count %> </td>