app/views/users/show.html.erb

<ul>
  <% @user.leagues.each do |l| %>
---
SELECT "leagues".* FROM "leagues" INNER JOIN "teams" ON "leagues"."id" = "teams"."league_id" WHERE "teams"."user_id" = ?  [["user_id", 3]]

<ul>
  <% @user.teams.each do |t| %>
---
SELECT "teams".* FROM "teams" WHERE "teams"."user_id" = ?  [["user_id", 3]]