app/views/players/index.html.erb

SELECT  1 AS one FROM "leagues" WHERE "leagues"."player_id" = ? AND "leagues"."id" = ? LIMIT 1  [["player_id", 1], ["id", 1]]
SELECT "leagues"."id" FROM "leagues" WHERE "leagues"."player_id" = ?  [["player_id", 1]]
SELECT "player_leagues"."league_id" FROM "player_leagues" WHERE "player_leagues"."player_id" = ?  [["player_id", 11]]
---

        <% unless pl.player_leagues.pluck(:league_id).include?(@league_id.id) %>