app/controllers/leagues_controller.rb

SELECT "leagues".* FROM "leagues"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
---
  def index
    @leagues = League.all

    if session[:user_id]
      @user = User.find(session[:user_id])

SELECT  "leagues".* FROM "leagues" WHERE "leagues"."id" = ? LIMIT 1  [["id", 2]]
---
  def edit
    @league = League.find(params[:id])

INSERT INTO "leagues" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "The Shapeeps League"], ["created_at", "2019-01-29 22:39:49.079765"], ["updated_at", "2019-01-29 22:39:49.079765"]]
---
  def create
    @league = League.create(league_params)

SELECT  "leagues".* FROM "leagues" WHERE "leagues"."id" = ? LIMIT 1  [["id", 2]]
---
  def show
    @league = League.find(params[:id])

SELECT  "leagues".* FROM "leagues" WHERE "leagues"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "leagues" SET "name" = ?, "updated_at" = ? WHERE "leagues"."id" = ?  [["name", "Amazing League"], ["updated_at", "2019-01-29 22:20:40.674125"], ["id", 2]]
---
  def update
    @league = League.find(params[:id])
    @league.update(league_params)