app/controllers/players_controller.rb

  def create
    @team = Team.find(params[:team_id])
    @player = Player.find_by(id: params[:id])
    @user_id = @team.user_id
    @league = League.find_by(id: params[:league_id])
---
SELECT  "leagues".* FROM "leagues" WHERE "leagues"."id" = ? LIMIT 1  [["id", 3]]