app/controllers/players_controller.rb

  def index
    @players = Player.search(params[:search])
    @team_id = Team.find(params[:team_id])
    @league_id = League.find(params[:league_id])

    if session[:user_id]
      @user = User.find(session[:user_id])
---
SELECT "players".* FROM "players" WHERE "players"."player_id" = 1
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT 1  [["id", 2]]
SELECT "leagues"."id" FROM "leagues" WHERE "leagues"."player_id" = ?  [["player_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]

  def create
    @team = Team.find(params[:team_id])
    @player = Player.find_by(id: params[:id])

    unless @player.player_leagues.pluck(:league_id).include?(@team.league.id)
      @player_league = PlayerLeague.create({league_id: @team.league.id, player_id: @player.id})
      @player.update(team_id: params[:team_id], league_id: @team.league.id)
---
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "players".* FROM "players" WHERE "players"."id" = ? LIMIT 1  [["id", 3]]
SELECT "player_leagues"."league_id" FROM "player_leagues" WHERE "player_leagues"."player_id" = ?  [["player_id", 11]]
INSERT INTO "player_leagues" ("league_id", "player_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["league_id", 4], ["player_id", 11], ["created_at", "2019-01-31 22:03:22.728633"], ["updated_at", "2019-01-31 22:03:22.728633"]]
INSERT INTO "players" ("name", "nba_team", "points", "position", "team_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
UPDATE "players" SET "team_id" = ?, "league_id" = ?, "updated_at" = ? WHERE "players"."id" = ?  [["team_id", 5], ["league_id", 3], ["updated_at", "2019-01-31 21:12:35.428655"], ["id", 4]]

  def destroy
    @player = Player.find_by(id: params[:id])
    @team_id = @player.team.id
    @user = @player.team.user_id
    @pl = @player.player_leagues.find_by(league_id: @player.team.league_id)
    if @user == current_user.id
      @pl.delete
      @player.update(team_id: nil, league_id: nil)
---
SELECT  "players".* FROM "players" WHERE "players"."id" = ? LIMIT 1  [["id", 4]]
SELECT  "player_leagues".* FROM "player_leagues" WHERE "player_leagues"."player_id" = ? AND "player_leagues"."league_id" = ? LIMIT 1  [["player_id", 33], ["league_id", 8]]
DELETE FROM "player_leagues" WHERE "player_leagues"."id" = ?  [["id", 22]]
UPDATE "players" SET "team_id" = ?, "league_id" = ?, "updated_at" = ? WHERE "players"."id" = ?  [["team_id", nil], ["league_id", nil], ["updated_at", "2019-01-31 23:05:30.738060"], ["id", 25]]