app/controllers/teams_controller.rb

SELECT  "leagues".* FROM "leagues" WHERE "leagues"."id" = ? LIMIT 1  [["id", nil]]
---
  def index
    @league = League.find(params[:id])

SELECT  "leagues".* FROM "leagues" WHERE "leagues"."id" = ? LIMIT 1  [["id", 2]]
---
  def new
    id = params[:id].nil? ? params[:league_id] : params[:id]
    @league = League.find(id)

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT 1  [["id", 2]]
---
  def edit
    @team = Team.find(params[:id])

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "teams" SET "name" = ?, "updated_at" = ? WHERE "teams"."id" = ?  [["name", "The Adair Team "], ["updated_at", "2019-01-31 16:29:39.369758"], ["id", 2]]
---
  def update
    @team = Team.find(params[:id])
    @team.update(team_params)

INSERT INTO "teams" ("name", "league_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Team MJ"], ["league_id", 1], ["user_id", 1], ["created_at", "2019-01-30 21:29:53.589165"], ["updated_at", "2019-01-30 21:29:53.589165"]]
---
  def create
    @team = Team.new(team_params)
    if @team.save