app/controllers/users_controller.rb

INSERT INTO "users" ("name", "password_digest", "email", "admin", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
---
  def show
    if session[:user_id]
      @user = User.find(session[:user_id])